# GetValues Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportLayerTable..::..GetValues Method
ExportLayerTable Class See Also
---
Returns all the values stored in the map.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public IList<ExportLayerInfo> GetValues()
```

Visual Basic
---
```text
Public Function GetValues As IList(Of ExportLayerInfo)
```

Visual C++
---
```text
public:
IList<ExportLayerInfo^>^ GetValues()
```

# ### Return Value
Return the info array.
# See Also
ExportLayerTable Class
Autodesk.Revit.DB Namespace